Tekla Open API Reference for Tekla Structures 2025
CustomPartInputTypeAttribute Constructor
Overload List
Name | Description
CustomPartInputTypeAttribute(Int32)
 The custom attribute uses this to store the input type to the system. This is not to be used by itself.
CustomPartInputTypeAttribute(CustomPartBase.CustomPartInputType)
 The custom attribute uses this to store the input type to the system. This is not to be used by itself.
Top
See Also
Reference
CustomPartInputTypeAttribute Class
Tekla.Structures.Plugins Namespace